{
  "navBar": {
    "home": "Home",
    "aboutme": "About me",
    "projects": "Projects",
    "cv": "CV",
    "contact": "Contact"
  },
  "Home": {
    "title": "Presentation",
    "content": {
      "accent": "GET TO KNOW ME!",
      "heading": "Hello! I'm Pau Ibáñez",
      "info1": "This website has everything you need to know about me and my work. I invite yo to explore it while also considering it's impact as a representation of my portfolio.",
      "info2": "I look forward to the possibility of connecting with you and collaborating on exciting projects.",
      "button": "My Portfolio"
    }
  },
  "Projects": {
    "title": "<&>My<&> Projects",
    "presentation": {
      "title": "<&>My<&> Project Portfolio",
      "text": "Here, you'll find a selection of my <&>finest work so far<&>. These projects highlight my proficiency in <&>various technologies<&> and showcase the answers to the problems I’ve faced while building them.  Throughout my portfolio, you'll notice a strong <&>emphasis on the technical aspects<&>, innovative solutions, and challenges overcome.\n \n <&>Quality<&> is paramount to me, and I believe in showcasing a curated selection of projects that represent <&>my best work<&>. Rather than presenting an extensive list, I have carefully chosen the projects that best exemplify my capabilities as full-stack developer. Even if <&>not all of my projects are websites<&> directly, I strongly believe that <&>my experience in these other platforms helped me become a better web developer<&> and made me a <&>better problem solver<&>.",
      "button": "Go to Projects",
      "title2": "My Projects"
    },
    "click": "Click for more info",
    "backToProjects": "Back to projects"
  },
  "CV": {
    "title": "<&>My<&> Curriculum",
    "presentation": {
      "title": "<&>My<&> Curriculum Vitae",
      "text": "Take a look at my curriculum, you can explore my <&>educational background<&> and <&>professional experience<&>. Furthermore, I have dedicated a section to outline the various <&>technologies and skills<&> I’ve worked with and developed over the years, along with my <&>proficiency level<&> in each of them. \n \nTo ensure your <&>convenience<&>, I have also created a <&>compact version of my CV in PDF format<&>, which you can easily <&>download<&>. The download options can be found at the <&>bottom of this page<&>.",
      "button": "Go to CV"
    },
    "sections": {
      "education": {
        "title": "Education",
        "items": [
          {
            "name": "ISDI Coders Bootcamp",
            "location": "Barcelona, Spain",
            "concept": "Bootcamp in Full-Stack Web Development",
            "dates": {
              "startDate": "Jan 2022",
              "endDate": "Mar 2022"
            },
            "textSections": [
              {
                "title": "What I learned",
                "text": "During my tenure at the ISDI Coders bootcamp, I had the opportunity to work extensively with some of my favorite technologies, including React, Node, Express, MongoDB, and Git. The program played a crucial role in deepening my understanding of JavaScript, enabling me to enhance my coding efficiency and sharpen my troubleshooting skills."
              },
              {
                "title": "Projects",
                "text": "Throughout my academic journey, I successfully completed a diverse range of projects, showcasing my expertise in various areas of software development. These projects encompassed front-end, back-end, and full-stack development, involving both native applications and framework-like apps."
              }
            ]
          },
          {
            "name": "Jesuïtes El Clot",
            "location": "Barcelona, Spain",
            "concept": "Professional Formation in Computer Systems and Networks",
            "dates": {
              "startDate": "Sep 2017",
              "endDate": "Jun 2019"
            },
            "textSections": [
              {
                "title": "What I learned",
                "text": "In this course I learned the ins and outs of PCs and Server Systems. I built both hardware and software, from assembling a PC to creating an HTTP Apache server. We did a lot of system virtualization and we worked on HTTP, Static and SMTP servers. We also learned to correctly use the consoles in different Operating Systems as well as to create scripts for task automation with them."
              },
              {
                "title": "Remarks",
                "text": "In this course, we did not have any programming classes, but I already loved it, so I spent a lot of free time in them trying out stuff. It’s while coursing in here that I was developing mini-games in unity."
              }
            ]
          }
        ]
      },
      "experience": {
        "title": "Experience",
        "items": [
          {
            "name": "Blikk",
            "location": "Reykjavik, Iceland (Remote)",
            "concept": "Full-Stack developer",
            "dates": {
              "startDate": "Jun 2022",
              "endDate": "Sep 2022"
            },
            "textSections": [
              {
                "title": "My Tasks",
                "text": "I Developed a Full-Stack banking application with Flutter, Dart and Go. My responsibilities included the architecture of the front-end app, the styling, some design (both design creation of certain elements and design interpretation). Development of both front and back-end with user authentication including OAuth and user recovery."
              }
            ]
          },
          {
            "name": "WebHelp / Google",
            "location": "Barcelona, Spain (Remote)",
            "concept": "Technical Support Engineer",
            "dates": {
              "startDate": "Jun 2021",
              "endDate": "Sep 2021"
            },
            "textSections": [
              {
                "title": "My Tasks",
                "text": "I Provided top tier customer support for Google Workspace. I investigated bugs and errors in the program and provided workaround solutions to the clients if available. My tasks focused primarily on investigation and client communication for companies using Google Workspace. I also provided consults for lower tiers of support that were in charge of individual or smaller clients."
              }
            ]
          },
          {
            "name": "i3e Informática",
            "location": "Mataró, Spain",
            "concept": "OS Technician",
            "dates": {
              "startDate": "Jan 2021",
              "endDate": "Feb 2021"
            },
            "textSections": [
              {
                "title": "My Tasks",
                "text": "I installed and configured a customized Windows OS on hundreds of PC’s for their use in the vaccination posts during the pandemic."
              }
            ]
          },
          {
            "name": "Laforja Sistemas S.L",
            "location": "Cabrera de mar, Spain",
            "concept": "Machine building technician",
            "dates": {
              "startDate": "Nov 2018",
              "endDate": "Apr 2019"
            },
            "textSections": [
              {
                "title": "My Tasks",
                "text": "I soldered and mounted logic boards for use in public transportation LED panels. I also mounted some of the LED panels themselves. Other than public transport, I configured and tested android players for their use in digital signage for hotels, companies’ internal channels, shop showcases, restaurant menus..."
              }
            ]
          }
        ]
      },
      "languages": {
        "title": "Languages",
        "text": "These are the lanaguages I speak and write along with my level at them.",
        "languages": ["Catalan", "Spanish", "English"],
        "native": "Native",
        "fluent": "Fluent",
        "sections": [
          "<&>Lan<&>guages",
          "Programmin <&>Languages",
          "Other <&>Languages"
        ]
      },
      "technologies": {
        "name": "Technologies",
        "title": "Technbologies and Skills",
        "text": "These are my most developed technologies and methodologies with an added rating. Note that the ratings reflect my evaluation of my general knowledge and proficiency in each respective area. However, understand that a high rating does not mean I claim to know everything about the given skill.",
        "pages": {
          "technologies": {
            "name": "Technologies",
            "names": {
              "databases": "Databases",
              "dataflow": "Unidirectional data flows",
              "versioncontrol": "Version control",
              "styling": "Styling",
              "methodology": "Methodologies"
            }
          },
          "skills": {
            "name": "Skills",
            "sections": [
              {
                "title": "Critical <&>Thinking",
                "text": "I possess a keen analytical mindset, evaluating information objectively and drawing logical conclusions."
              },
              {
                "title": "<&>Team<&>work",
                "text": "I thrive in collaborative environments, fostering open communication, trust, and mutual respect. I actively contribute to group dynamics, valuing diverse perspectives and working towards shared goals."
              },
              {
                "title": "Problem <&>Thinking",
                "text": "I excel at breaking down complex problems, anticipating obstacles, and devising innovative solutions. I strongly believe that troubleshooting is the most important skill to have as a programmer. No one's code always works the first time, and it's important to know how to find what's causing the error."
              },

              {
                "title": "<&>Flex<&>ibility",
                "text": " I thrive in dynamic and changing environments. I embrace new challenges, willingly take on different roles, and effectively contribute to team objectives."
              },
              {
                "title": "De<&>sign (me, xd)",
                "text": "I do not consider myself to be a designer, but I have an eye for it. I won’t create the best design, but I’ll know when something doesn’t work right. I put myself in the position of the end user and I try to figure out the best layout and style for the desired  purpose of the page."
              },
              {
                "title": "<&>Fast <&>learning",
                "text": "I think of myself as a fast learner. My experience with such varies technologies and developing enviroments allows me to adapt to new ones with ease."
              }
            ]
          },
          "controls": {
            "prev": "Prev",
            "page": "Page",
            "next": "Next"
          }
        }
      },
      "references": {
        "title": "References",
        "button": {
          "original": "View original (english)",
          "translated": "View translated"
        },
        "items": [
          {
            "name": "Gunnar Kolbeinsson",
            "position": "CTO at Blikk Hugbúnaðarþjónusta hf.",
            "email": "gunnar@getblikk.is",
            "linkedIn": "linkedin.com/in/gunnarkolbeinsson",
            "letter": "It is my pleasure to recommend Pau Ibáñez for employment.\n I was Pau’s immediate supervisor at Blikk Hugbúnaðarþjónusta hf. in Iceland. Pau was hired for a 2-month internship as a remote frontend developer and managed to deliver a prototype mobile application written in Dart with the Flutter framework, along with a backend server written in Go.\n\n We are a small open banking software company in Iceland applying for a financial license and looking to create a platform for open banking services. Unfortunately, we could not hire Pau full-time due to uncertainty regarding the operating license of the company and a lack of resources thereof.\n\n Pau is a talented and driven programmer. He managed to research and come up with solutions to problems and was very keen to figure out how to implement a number of different aspects of the prototype app. He even offered some interesting ideas on how to improve the codebase and coding in a somewhat immature development environment of our small and recently founded startup. He finished tasks according to plan, on time and according to specification and design immaculately.\n\n Pau is a very skilled communicator, both in written and spoken language. He is Spanish but speaks English fluently and with an excellent technical vocabulary. We communicated mostly on Slack but shared a Zoom call every few days and more often if needed. Pau had the initiative to propose some ideas of features to add to the project as well ideas for different implementations on some features. Pau could deliver those ideas concisely and clearly while still maintaining coding velocity. He was also very easy to get along with and chat with and is really friendly.\n\n Pau managed to complete his assignments brilliantly and made an impact on our organization despite his short tenure. I am confident that he will continue to grow as a programmer and make an impact everywhere he goes. Please feel free to contact me if there is anything you would like to discuss further with Pau Ibáñez and I will happily have a chat.\n\n Best Regards \n Gunnar Kolbeinsson\n Head of Product\n Blikk"
          }
        ]
      },
      "download": {
        "title": "Download",
        "text": "Having read or not my curriculum in this format, I’ve prepared some PDF files so you can download them. These files contain my CV, a recommendation letter and a cover letter. You can also find the option to download them combined into a single PDF file.",
        "disclaimer": "By downloading the files listed here, you are granted permission to store and review them. However, you are strictly prohibited from sharing these files without obtaining explicit written consent from me. If you wish to share these files with a 3rd party, please contact me to obtain the necessary permissions.\n\n Job search agencies are authorized to share the CV with the end employer company solely for the purpose of employment consideration. However, they must ensure the confidentiality and proper handling of these files during the recruitment process.",
        "checkmark": "I accept the terms and conditions.",
        "checkmarkError": "Accept terms and conditions",
        "buttonText": "Download",
        "items": [
          "My Curriculum Vitae",
          "Recommendation letter",
          "Combined PDF"
        ]
      }
    }
  },
  "AboutMe": {
    "title": "Let's hear about <&>me<&>!",
    "textSections": [
      {
        "title": "Who am <&>I<&>?",
        "text": "I'm <&>Pau Ibáñez<&>, a 21-year-old programmer from Barcelona, specialized in <&>full-stack<&> web and app development. I’m Driven by a strong desire to generate new and innovative ideas with the understanding that in this industry <&>we can never stop learning<&>. I love being a developer because it grants me the freedom to transform my ideas into reality."
      },
      {
        "title": "<&>Team<&> Player",
        "text": "Beyond my individual projects, I’ve found great fulfillment in <&>connecting with other developers<&> and working together as a <&>team<&>. \n \n I’ve worked in a couple of international projects where I was able to <&>expand my abilities by learning and sharing with my peers<&>. \n \n This part of my career has been mostly focused on game developing and modding and it helped me develop my skills as a team player and showed me that <&>sharing your code and ideas the allways improves the project<&>."
      },
      {
        "title": "<&>Lazy<&> Yet Resourceful",
        "text": "I am <&>lazy<&>, but as a programmer I consider this to be <&>an excellent skill<&> to have. Being lazy pushes me to <&>find efficient and creative solutions<&> to complex problems. I believe in working smarter, not harder. \n \n Being lazy does not mean I compromise in quality; instead, I find ways to <&>streamline<&> my work and eliminate unnecessary or tedious tasks. At the end of the day this is what <&>workflow optimization<&> is all about! \n For example, this text may or may not have been created with the help of chat GPT 😜. \n \n I am keen to spend 5h working on a solution for a 1h task if it means that I never have to do it again."
      },
      {
        "title": "<&>My<&> Programming Journey",
        "text": "From a young age, I've been fascinated by programming. It all started with a curiosity for building robots using <&>Arduino<&> with <&>C++<&>. Eventually, my passion shifted towards creating games, starting with Scratch, and eventually finding <&>Unity<&>, where I developed my skills in <&>C#<&>. I immersed myself in learning different programming languages based on my interests at the time. For example, I explored <&>JavaScript<&> with (unfortunatley) <&>JQuery<&> when I built my first user interface, and I learned in <&>Lua<&> and <&>SQL<&> while creating video game mods. This journey helped me become a <&>versatile full-stack developer<&>, familiar with various platforms and technologies.\n \n Although I had a decent understanding of different programming languages, I realized my coding practices were messy and unreliable. That's when I decided to enroll in the <&>ISDI Coders Bootcamp<&> in Barcelona. For three intensive months, I dedicated myself to develop my skills in <&>JavaScript and TypeScript<&>, specially using the <&>MERN stack<&>, spending 12 hours a day, seven days a week creating web pages and entire full-stack apps. The boot-camp not only refined my coding abilities but also taught me how to code while keeping consistency, good practices and scalability in my apps.\n \n After completing the boot-camp, I landed my first full-stack job at Blikk, a banking startup from Iceland. Interestingly, I didn't get to use the programming languages I had learned up to that point. However, my previous experience of learning new languages prepared me for the challenge and I successfully built a <&>full-stack mobile app<&> using <&>Dart<&> and <&>Flutter<&> for the front-end and <&>Golang<&> for the back-end."
      }
    ],
    "images": ["3 people with their hands up", "Cartoon man climbing a ladder"]
  },
  "Contact": {
    "title": "Contact <&>me<&>",
    "textSections": [
      {
        "title": "Welcome to <&>my<&> Contact page!",
        "text": "If you have any questions, inquiries, or would simply like to <&>get in touch<&>, I would be thrilled to hear from you. Whether you're interested in <&>collaborating<&> on a project, discussing a <&>potential opportunity<&>, or just want to <&>say hello<&>, this is the place to reach out. Feel free to fill out the contact form, and I will make sure to get back to you as soon as possible. Additionally, if you prefer to email me directly, you can reach me through the provided email address or phone number. \n \n <&>Thank you<&> for visiting my portfolio website, and <&>I look forward to hearing from you soon!<&>"
      },
      {
        "title": "Privacy Notice",
        "text": "By contacting me via this form or sending an email, you acknowledge and consent that the information you provide, including your name and email address, will be collected and stored for the purpose of responding to your inquiry."
      }
    ],
    "contactInfo": {
      "title": "Let’s get in touch!",
      "text": "Feel free to contact me directly through any of the options bellow:",
      "itemNames": {
        "phone": "Phone",
        "email": "Email",
        "linkedIn": "LinkedIn"
      },
      "itemValues": {
        "copyEmail": "Copy email",
        "openEmail": "Open email",
        "linkedIn": "My LinkedIn profile"
      }
    },
    "contactForm": {
      "labels": {
        "firstName": "First Name",
        "lastName": "Last Name",
        "messageType": "Message Type",
        "projectName": "Project Name",
        "companyName": "Company Name",
        "applicable": "if applicable",
        "email": "Email",
        "subject": "Subject",
        "message": "Message"
      },
      "sendMessage": "Send Message",
      "messageTypes": {
        "select": "Select One",
        "jobOpportunity": "Job Opportunity",
        "collaboration": "Collaboration",
        "generalQuestion": "General Question",
        "other": "Other..."
      },
      "errors": {
        "email": ["An email is required", "Invalid email format"],
        "firstName": "First Name is required",
        "lastName": "Last Name is required",
        "subject": "Subject is required",
        "message": "We are missing the message!"
      }
    }
  },
  "NotFound": {
    "title": "<&>404<&> Page Not Found",
    "text": "How did we end up here?",
    "image": "A lost man"
  },
  "Minigames": {
    "title": "<&>Mini<&>games",
    "text": "I’ve added a couple of minigames designed to be <&>light<&> and <&>fast<&>. Feel free to take a break and <&>enjoy disconnecting for a bit<&>!",
    "memory": {
      "title": "Memory",
      "text": "The goal of this game is to match pairs of cards. The cards are placed face down, you have to flip  them over to 2 at a time to find the matching pairs. You have to remember the positions of the cards and complete all the pairs in the shorest amout of moves possible. Try out a harder difficulty for a bigger challenge!",
      "stats": {
        "difficulty": "Difficulty",
        "difficulties": ["Easy", "Normal", "Hard"],
        "pairs": "Matched pairs",
        "moves": "Moves",
        "minMoves": "Your minimum moves"
      },
      "buttons": {
        "reset": "Restart Game",
        "difficulty": "Change Difficulty"
      }
    },
    "simon": {
      "title": "Simon",
      "text": "The goal of this game is to repeat a sequence of colors. Simon will display a sequence, and you must repeat it by pressing the corresponding buttons. The challenge is to remember and replicate the sequence accurately for as long as possible.",
      "stats": {
        "streak": "Steak",
        "maxStreak": "Your best streak"
      },
      "buttons": {
        "notPlaying": "Play Simon",
        "playing": "Restart Game"
      },
      "colorNames": ["YELLOW", "BLUE", "GREEN", "RED"]
    },
    "projectCard": {
      "name": "Minigames",
      "description": "A few minigames to pass the time."
    }
  },
  "BackendTemplate": {
    "title": "<&>Backend<&> template",
    "text": "I’ve created a fully set up and tested REST API template complete with a database connection and full user support.",
    "sections": [
      {
        "title": "Features",
        "text": "The key features included in this template are:",
        "features": [
          "MongoDB Database connection.",
          "Created file structure.",
          "User authentication with a boilerplate user schema.",
          "Email service integration for user creation, verification and recovery.",
          "Error handling.",
          "100% tested (unit and integration).",
          "Automated scripts for build, start, development watch build and testing."
        ]
      },
      {
        "title": "Users",
        "text": "The template has user support built-in, these are the features it contains:",
        "features": [
          "User registration with email verification. by email",
          "User login.",
          "User login via OTP via email.",
          "Password recovery.",
          "User session auto-refresh."
        ],
        "text2": "The user autentication is built with JsonWebToken. The standard token session is 2h, but this is customizable to your needs."
      },
      {
        "title": "Testing",
        "text": "This template is fully tested with jest and SonarQube Scanner. This has a 100% coverage in unit tests plus some integration tests for the endpoints. \n \n Testing commands:",
        "features": [
          "<&>npm test<&> - This command will run all the tests once.",
          "<&>npm run testCov<&> - This command will run al tests and the coverage in watch mode.",
          "<&>npm run testCovNoWatch<&> - This command will run all tests and their coverage once."
        ],
        "text2": "To run SonarQube Scanner and see a detialed breakdown of the tests, create a new SonarQube project with your prefeered settings. After thar update the sonar-project.propperties file with your project name and you are all set. \n \n To run it simply, asuming u already have SonarQube up and running, run:",
        "feature2": "sonar-scanner.bat -D\"sonar.login=YOUR_SONAR_PROJECT_KEY_HERE\""
      },
      {
        "title": "Links",
        "text": "Feel free to visit the gitHub page and take a look at the code. \n This repo is marked as a template so you can create your own API with a couple of clicks!",
        "link": "GitHub Repository page"
      }
    ],
    "projectCard": {
      "name": "Backend Template",
      "description": "A complete typescript REST API template with users"
    }
  },
  "MyPortfolio": {
    "title": "<&>My<&> portfolio",
    "text": "Explore with me all the details about my portfolio website (this one). Check out the development, testing and production deployment details.",
    "projectCard": {
      "name": "My Portfolio",
      "description": "A webpage to showcase my portfolio, CV and a little about myself."
    },
    "management": {
      "title": "Project management",
      "text": "In order to keep me organized, I've used varius task management and design tools. Other than the obvious version control, git. \n \n For this project I've used <&>GitHub<&> for the version control hosting, <&>Monday<&>, a task management tool and <&>Figma<&> for the website design. Check out these relevant links for an insignt on my project management while building this website.",
      "linkSections": [
        {
          "name": "GitHub",
          "links": ["Front-End", "Back-End"]
        },
        {
          "name": "My Monday boards",
          "links": ["Project management", "Front-End", "Back-End"]
        },
        {
          "name": "Figma",
          "links": ["Figma design", "Figma prototype"]
        }
      ]
    },
    "enviroments": {
      "title": "Enviroments",
      "text": "This website has been worked on using the react-embeded webpack solution for the front and using nodemon for the back. \n My production enviroment has been implemented using <&>Netlify<&>'s hosting service for the front and <&>Render<&> for the back.",
      "text2": "I've also used both Netlify's actions aswell as my own <&>Audit action<&> which performs some checks before allowing me to push to production. The most important chekcs it perofrms are the <&>ESLint validation<&> (code formating) and the <&>Testing validation<&> which ensures all tests pass.",
      "linkSections": [
        {
          "name": "Enviroment providers:",
          "links": ["Netlify Front-End", "Render Back-End"]
        },
        {
          "name": "Check the workflow out:",
          "links": ["Audit action"]
        }
      ]
    },
    "design": {
      "title": "Design",
      "text": "This website is almost completley of my own design, all except my home page, that was heavely inspired by a posted template design from a UX/UI designer. Unfortunatley I can't find the original image. If it's your design please contact me so I can add the propper credits!"
    },
    "languages": {
      "title": "Languages",
      "text": "I've implemented i18n with i18n-react to be able to present my portfolio en english and spanish, this was my 2nd time ever using i18n, with the first one being at Blikk, using it with Flutter, so kind of the first time. I've learned that It's super easy to use, but translating 800 different texts takes a lot of time 😩. \n \n You can find the language toggle on the top left in case you missed it."
    },
    "coding": {
      "title": "",
      "text": "As you've seen in the project tags, this website is built with react and typescript, my favorite platforms for constructiong web elements! I've focused on writing clean and mantainable code, adhering to a DRY mentality, but not going so obverboard that I restrict myself on design changes in the future. \n I strongly invite you to visit the GitHub page linked above and check out some of my code. \n \n This time, for the back-end, I've used my own template for the server base, even though I don't need any users for this website it was still easier to use that template and strip the user parts than to construct a new server yet again!",
      "linkSection": {
        "name": "You can find my emplate in the projects page or here:",
        "link": "Backend template"
      }
    },
    "testing": {
      "title": "Testing",
      "text": "Since the very begining of the project I've been testing most of my code. Even though the <&>80% coverage<&> is standard I usually like to strive for that sweet <&>100%<&>. Who does not get dopamine sseing all the geen 100's haha. Anyway, most of my code has been thurougly tested, but I have encountered some problemts, mostly regarding the scroling functionalities, because aparently <&>jest<&> and <&>testing-library<&> don't have scroll testing support yet, since they are node-based testing enviroments.",
      "sections": [
        {
          "name": "SonarQube",
          "text": "I like to use SonarQube and Sonar Scanner as my static analizer to keep a more acturate track of my coverage, possible bugs or code smells. This is why I've included my sonar-project.properties file in the repo, allowing a propper implementation in any terminal in a cople clicks. \n \n  In my last scann  most problems were fixed with the exception of the duplications, which are sitting at 7.0%. This is due to test repetiotions, since testing should be done spearate in each test and that does lead to some duplicated blocks that I decided to keep to mantain the test integrity. \n  This is my last analized summary:",
          "image": "SonarQube summary - 0 Bugs | 0 Code Smells | 0 Vulnerabilities | 0 Security Hotspots | 92.4% Coverage | 7.0% Duplications on 34 blocks"
        },
        {
          "name": "Jest and Testing-library",
          "text": "I use jest with the react/testing-library when testing my react apps. I find it easy to use and super complete for what it was designed to do. \n Here are my latests jest coverage metrics by file:",
          "image": "jest coverage terminal - 0 Failed tests | 146 Passed tests | 44 Test suites - Statements covered 95.41% |  Branches covered 94.07% | Functions covered 95.12% | Lines covered 95.85%"
        }
      ]
    }
  },
  "NPM": {
    "projectCard": {
      "name": "NPM Packages",
      "description": "Check out my published NPM packages"
    }
  }
}
